Autodesk.Revit.DB.Analysis.PathOfTravel.SetDistanceMapModeForRooms(Autodesk.Revit.DB.View,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Sets Distance Map mode for the given view, displaying distances to the closest destination point.
DBView:
The view to set Distance Map mode for.
newState:
New state of Distance Map mode to be set for the view.
destinationPoints:
Destination points for which Distance Map is calculated.
This argument is ignored when setting the mode off.
Returns:
Result status of the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2021

Autodesk.Revit.DB.Analysis.PathOfTravel.IsInDistanceMapModeForRooms(Autodesk.Revit.DB.View)
Returns current state of Distance Map mode for the given view.
DBView:
The view to determine current state of Distance Map mode for.
Returns:
True if Distance Map mode is ON for the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The Path of Travel calculation service is not available
Since:
2021

Autodesk.Revit.DB.Analysis.PathOfTravel.SetRevealObstaclesMode(Autodesk.Revit.DB.View,System.Boolean)
Sets Reveal Obstacles mode for the given view.
DBView:
The view to set Reveal Obstacles mode for.
newState:
New state of Reveal Obstacles mode to be set for the view.
Returns:
Result status of the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The Path of Travel calculation service is not available
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020.1

Autodesk.Revit.DB.Analysis.PathOfTravel.IsInRevealObstaclesMode(Autodesk.Revit.DB.View)
Returns current state of Reveal Obstacles mode for the given view.
DBView:
The view to determine current state of Reveal Obstacles mode for.
Returns:
True if Reveal Obstacles mode is ON for the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The Path of Travel calculation service is not available
Since:
2020.1

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMapped(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start or end points are of zero size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnds:
The end points of the path. The input Z coordinates are ignored and set to the view's level elevation.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The number of elements is the number of start points multiplied by the number of end points.
The order of elements corresponds to the order of end and then start points in the argument arrays:
s0->e0, s1->e0, ... , s0->e1, s1->e1... etc.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMapped(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus}@)
Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start or end points are of zero size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnds:
The end points of the path. The input Z coordinates are ignored and set to the view's level elevation.
resultStatus:
Result statuses of each path of travel creation.
The order of statuses corresponds to the order of elements in the array returned by the function.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The number of elements is the number of start points multiplied by the number of end points.
The order of elements corresponds to the order of end and then start points in the argument arrays:
s0->e0, s1->e0, ... , s0->e1, s1->e1... etc.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMultiple(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus}@)
Creates multiple new paths of travel between same size sets of start and end points and provides creation result statuses.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start and end points are of different size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnds:
The end points of the path. The input Z coordinates are ignored and set to the view's level elevation.
resultStatus:
Result statuses of each path of travel creation.
The order of statuses corresponds to the order of elements in the array returned by the function.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The order of elements corresponds to the order of start/end points in the argument arrays.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.CreateMultiple(Autodesk.Revit.DB.View,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates multiple new paths of travel between same size sets of start and end points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)
ArgumentException exception is thrown if arrays of start and end points are of different size
or if the total number of paths of travel attempted to be created is more than maximum allowed (50000).
DBView:
The floor plan view to use when computing the shortest distance.
pathStarts:
The start points of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnds:
The end points of the path. The input Z coordinates are ignored and set to the view's level elevation.
Returns:
The array of newly created path of travel elements, or null if no path between the two points is found.
The order of elements corresponds to the order of start/end points in the argument arrays.
There are some additional conditions that are checked and if any condition is true the null value is returned:
View has crop box active and start or end point lies outside of the crop  Start and end points are too close
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new path of travel between two points.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split   View has crop box active and start or end point lies outside of the crop  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)  Start and end points are too close
DBView:
The floor plan view to use when computing the shortest distance.
pathStart:
The start point of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnd:
The end point of the path. The input Z coordinates are ignored and set to the view's level elevation.
Returns:
The newly created path of travel element, or null if no path between the two points is found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020

Autodesk.Revit.DB.Analysis.PathOfTravel.Create(Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Analysis.PathOfTravelCalculationStatus@)
Creates a new path of travel between two points and provides creation result status.
Remarks:
InvalidOperationException is thrown if PathOfTravel cannot be created for the following conditions:
View has crop box active and crop box is split   View has crop box active and start or end point lies outside of the crop  View model outline area is larger than the current limit (2,000,000 sq.ft.)  View export contains too much geometry (more than 200,000 lines)  Start and end points are too close
DBView:
The floor plan view to use when computing the shortest distance.
pathStart:
The start point of the path. The input Z coordinates are ignored and set to the view's level elevation.
pathEnd:
The end point of the path. The input Z coordinates are ignored and set to the view's level elevation.
resultStatus:
Result status of path of travel creation.
Returns:
The newly created path of travel element, or null if no path between the two points is found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
View is not in a family or a document in in-place edit mode.
-or-
View is not a floor plan view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
This operation cannot be performed while the document is in edit mode.
-or-
The Path of Travel calculation service is not available
-or-
This functionality is not available in Revit LT.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document containing DBView is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document containing DBView is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document containing DBView has no open transaction.
Since:
2020